import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-check-form',
  templateUrl: './check-form.component.html',
  styleUrls: ['./check-form.component.css']
})
export class CheckFormComponent implements OnInit {

  cardDetail = [
    {title: 'คำขอจัดตั้งครุภัณ์...', detail: ' นอกจากนี้ การศึกษาข้อมูล เกี่ยวกับ ทิศทาง กรอบยุทธศาสตร์ แผนแม่บท และกฎหมายที่เกี่ยวข้องกับการพัฒนาประเทศ พบว่า ประเด็นสำคัญเพื่อแปลงแผนไปสู่การปฏิบัติให้เกิดผลสัมฤทธิ์ได้อย่างแท้จริง คือ การเตรียมพร้อมด้านกำลังคนและการเสริมสร้างศักยภาพของประชากรในทุกช่วงวัย มุ่งเน้นการยกระดับคุณภาพทุนมนุษย์ของประเทศ โดยพัฒนาคนให้เหมาะสมตามช่วงวัย เพื่อให้เติบโตอย่างมีคุณภาพ การพัฒนาทักษะที่สอดคล้องกับความต้องการในตลาดแรงงานและทักษะที่จำเป็น ต่อการดำรงชีวิตในศตวรรษที่ 21 ของคนในแต่ละช่วงวัยตามความเหมาะสม การเตรียมความพร้อมของกำลังคนด้าน วิทยาศาสตร์และเทคโนโลยีที่ จะเปลี่ยนแปลงในอนาคต ตลอดจนการยกระดับคุณภาพการศึกษาสู่ความเป็นเลิศ', dateTime: '05 ธ.ค. 2563 - 16:11'},
    {title: 'คำขอจัดตั้งครุภัณ์...', detail: ' นอกจากนี้ การศึกษาข้อมูล เกี่ยวกับ ทิศทาง กรอบยุทธศาสตร์ แผนแม่บท และกฎหมายที่เกี่ยวข้องกับการพัฒนาประเทศ พบว่า ประเด็นสำคัญเพื่อแปลงแผนไปสู่การปฏิบัติให้เกิดผลสัมฤทธิ์ได้อย่างแท้จริง คือ การเตรียมพร้อมด้านกำลังคนและการเสริมสร้างศักยภาพของประชากรในทุกช่วงวัย มุ่งเน้นการยกระดับคุณภาพทุนมนุษย์ของประเทศ โดยพัฒนาคนให้เหมาะสมตามช่วงวัย เพื่อให้เติบโตอย่างมีคุณภาพ การพัฒนาทักษะที่สอดคล้องกับความต้องการในตลาดแรงงานและทักษะที่จำเป็น ต่อการดำรงชีวิตในศตวรรษที่ 21 ของคนในแต่ละช่วงวัยตามความเหมาะสม การเตรียมความพร้อมของกำลังคนด้าน วิทยาศาสตร์และเทคโนโลยีที่ จะเปลี่ยนแปลงในอนาคต ตลอดจนการยกระดับคุณภาพการศึกษาสู่ความเป็นเลิศ', dateTime: '05 ธ.ค. 2563 - 16:11'},
    {title: 'คำขอจัดตั้งครุภัณ์...', detail: ' นอกจากนี้ การศึกษาข้อมูล เกี่ยวกับ ทิศทาง กรอบยุทธศาสตร์ แผนแม่บท และกฎหมายที่เกี่ยวข้องกับการพัฒนาประเทศ พบว่า ประเด็นสำคัญเพื่อแปลงแผนไปสู่การปฏิบัติให้เกิดผลสัมฤทธิ์ได้อย่างแท้จริง คือ การเตรียมพร้อมด้านกำลังคนและการเสริมสร้างศักยภาพของประชากรในทุกช่วงวัย มุ่งเน้นการยกระดับคุณภาพทุนมนุษย์ของประเทศ โดยพัฒนาคนให้เหมาะสมตามช่วงวัย เพื่อให้เติบโตอย่างมีคุณภาพ การพัฒนาทักษะที่สอดคล้องกับความต้องการในตลาดแรงงานและทักษะที่จำเป็น ต่อการดำรงชีวิตในศตวรรษที่ 21 ของคนในแต่ละช่วงวัยตามความเหมาะสม การเตรียมความพร้อมของกำลังคนด้าน วิทยาศาสตร์และเทคโนโลยีที่ จะเปลี่ยนแปลงในอนาคต ตลอดจนการยกระดับคุณภาพการศึกษาสู่ความเป็นเลิศ', dateTime: '05 ธ.ค. 2563 - 16:11'},
    {title: 'คำขอจัดตั้งครุภัณ์...', detail: ' นอกจากนี้ การศึกษาข้อมูล เกี่ยวกับ ทิศทาง กรอบยุทธศาสตร์ แผนแม่บท และกฎหมายที่เกี่ยวข้องกับการพัฒนาประเทศ พบว่า ประเด็นสำคัญเพื่อแปลงแผนไปสู่การปฏิบัติให้เกิดผลสัมฤทธิ์ได้อย่างแท้จริง คือ การเตรียมพร้อมด้านกำลังคนและการเสริมสร้างศักยภาพของประชากรในทุกช่วงวัย มุ่งเน้นการยกระดับคุณภาพทุนมนุษย์ของประเทศ โดยพัฒนาคนให้เหมาะสมตามช่วงวัย เพื่อให้เติบโตอย่างมีคุณภาพ การพัฒนาทักษะที่สอดคล้องกับความต้องการในตลาดแรงงานและทักษะที่จำเป็น ต่อการดำรงชีวิตในศตวรรษที่ 21 ของคนในแต่ละช่วงวัยตามความเหมาะสม การเตรียมความพร้อมของกำลังคนด้าน วิทยาศาสตร์และเทคโนโลยีที่ จะเปลี่ยนแปลงในอนาคต ตลอดจนการยกระดับคุณภาพการศึกษาสู่ความเป็นเลิศ', dateTime: '05 ธ.ค. 2563 - 16:11'},
    {title: 'คำขอจัดตั้งครุภัณ์...', detail: ' นอกจากนี้ การศึกษาข้อมูล เกี่ยวกับ ทิศทาง กรอบยุทธศาสตร์ แผนแม่บท และกฎหมายที่เกี่ยวข้องกับการพัฒนาประเทศ พบว่า ประเด็นสำคัญเพื่อแปลงแผนไปสู่การปฏิบัติให้เกิดผลสัมฤทธิ์ได้อย่างแท้จริง คือ การเตรียมพร้อมด้านกำลังคนและการเสริมสร้างศักยภาพของประชากรในทุกช่วงวัย มุ่งเน้นการยกระดับคุณภาพทุนมนุษย์ของประเทศ โดยพัฒนาคนให้เหมาะสมตามช่วงวัย เพื่อให้เติบโตอย่างมีคุณภาพ การพัฒนาทักษะที่สอดคล้องกับความต้องการในตลาดแรงงานและทักษะที่จำเป็น ต่อการดำรงชีวิตในศตวรรษที่ 21 ของคนในแต่ละช่วงวัยตามความเหมาะสม การเตรียมความพร้อมของกำลังคนด้าน วิทยาศาสตร์และเทคโนโลยีที่ จะเปลี่ยนแปลงในอนาคต ตลอดจนการยกระดับคุณภาพการศึกษาสู่ความเป็นเลิศ', dateTime: '05 ธ.ค. 2563 - 16:11'},
    // {title: 'คำขอจัดตั้งครุภัณ์...', detail: ' The Shiba Inu is the smallest of the six original and distinct spitz breeds of dog from Japan.A small, agile dog that copes very well with mountainous terrain, the Shiba Inu was originally bred for hunting.', dateTime: '05 ธ.ค. 2563 - 16:11'},
    // {title: 'คำขอจัดตั้งครุภัณ์...', detail: ' The Shiba Inu is the smallest of the six original and distinct spitz breeds of dog from Japan.A small, agile dog that copes very well with mountainous terrain, the Shiba Inu was originally bred for hunting.', dateTime: '05 ธ.ค. 2563 - 16:11'},
    // {title: 'คำขอจัดตั้งครุภัณ์...', detail: ' The Shiba Inu is the smallest of the six original and distinct spitz breeds of dog from Japan.A small, agile dog that copes very well with mountainous terrain, the Shiba Inu was originally bred for hunting.', dateTime: '05 ธ.ค. 2563 - 16:11'},
    // {title: 'คำขอจัดตั้งครุภัณ์...', detail: ' The Shiba Inu is the smallest of the six original and distinct spitz breeds of dog from Japan.A small, agile dog that copes very well with mountainous terrain, the Shiba Inu was originally bred for hunting.', dateTime: '05 ธ.ค. 2563 - 16:11'}
  ];
  constructor() { }

  ngOnInit(): void {
    
  }

}
